---
kind: property
id: P:Autodesk.Revit.UI.Events.ViewActivatedEventArgs.PreviousActiveView
source: html/1417a2d1-a1cc-8e24-7ee3-7c411d9142ca.htm
---
# Autodesk.Revit.UI.Events.ViewActivatedEventArgs.PreviousActiveView Property

The previously active view.

## Syntax (C#)
```csharp
public View PreviousActiveView { get; }
```

## Remarks
May be Nothing nullptr a null reference ( Nothing in Visual Basic) if there was no previously active view.